# Marging and Joining Data

In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [4]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [5]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [6]:
pd.merge(employees, departments, on='DeptID') # Inner Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [7]:
pd.merge(employees, departments, on='DeptID', how='left')  # Left Join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [8]:
pd.merge(employees, departments, on='DeptID', how='right')  # Right Join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [9]:
  pd.merge(employees, departments, on='DeptID', how='outer')  # Outer Join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [21]:
# Concatenating DataFrames
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], 'Score' : [23, 24]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], 'Age' : [20, 21]})

In [22]:
df1

    Name  Score
0  Alice     23
1    Bob     24

In [23]:
df2

      Name  Age
0  Charlie   20
1    David   21

In [24]:
pd.concat([df1, df2])

      Name  Score   Age
0    Alice   23.0   NaN
1      Bob   24.0   NaN
0  Charlie    NaN  20.0
1    David    NaN  21.0

In [25]:
pd.concat([df1, df2], axis=1)

    Name  Score     Name  Age
0  Alice     23  Charlie   20
1    Bob     24    David   21